doc/FAQ.org
#+SETUPFILE: theme-readtheorg.setup 

* FAQ                                                       :TOC_4_org:noexport:
 - [[Common][Common]]
   - [[Which version of Spacemacs am I running?][Which version of Spacemacs am I running?]]
   - [[What is the official pronunciation of Spacemacs?][What is the official pronunciation of Spacemacs?]]
   - [[Why are packages installed with =package-install= automatically deleted by Spacemacs when it boots?][Why are packages installed with =package-install= automatically deleted by Spacemacs when it boots?]]
   - [[The Spacemacs banner is ugly, what should I do?][The Spacemacs banner is ugly, what should I do?]]
   - [[The powerline separators are ugly, how can I fix them?][The powerline separators are ugly, how can I fix them?]]
   - [[The powerline separators have no anti-aliasing, what can I do?][The powerline separators have no anti-aliasing, what can I do?]]
   - [[Why is after-init-hook not executed?][Why is after-init-hook not executed?]]
   - [[What is the difference between =spacemacs-base= and =spacemacs= distributions?][What is the difference between =spacemacs-base= and =spacemacs= distributions?]]
   - [[How can I change or define an alias for an =evil-leader= prefix?][How can I change or define an alias for an =evil-leader= prefix?]]
   - [[Should I place my settings in =user-init= or =user-config=?][Should I place my settings in =user-init= or =user-config=?]]
   - [[Why do some of my =org=-related settings cause problems?][Why do some of my =org=-related settings cause problems?]]
 - [[How do I...][How do I...]]
   - [[Disable a package completely?][Disable a package completely?]]
   - [[Disable a package only for a specific major-mode?][Disable a package only for a specific major-mode?]]
   - [[Disable company for a specific major-mode?][Disable company for a specific major-mode?]]
   - [[Change special buffer rules?][Change special buffer rules?]]
   - [[Enable navigation by visual lines?][Enable navigation by visual lines?]]
   - [[Disable evilification of a mode?][Disable evilification of a mode?]]
   - [[Include underscores in word motions?][Include underscores in word motions?]]
   - [[Setup =$PATH=?][Setup =$PATH=?]]
 - [[Windows][Windows]]
   - [[Why do the fonts look crappy on Windows?][Why do the fonts look crappy on Windows?]]
   - [[Why is there no Spacemacs logo in the startup buffer?][Why is there no Spacemacs logo in the startup buffer?]]
   - [[Why are all packages unavailable?][Why are all packages unavailable?]]
 - [[OS X][OS X]]
   - [[Why are the powerline colors not correct on OS X?][Why are the powerline colors not correct on OS X?]]

* Common
** Which version of Spacemacs am I running?
The version is displayed on the upper right corner of the loading screen. You
may also just type ~SPC f e v~.

** What is the official pronunciation of Spacemacs?
As it is written, that is _space_ then _macs_.

** Why are packages installed with =package-install= automatically deleted by Spacemacs when it boots?
To declare new packages you have to create a new configuration layer, see the
[[file:QUICK_START.org][quick start guide]].

** The Spacemacs banner is ugly, what should I do?
Install the default font supported by Spacemacs or choose a fixed width font.
More information in the font section of the [[file:DOCUMENTATION.org][documentation]].

** The powerline separators are ugly, how can I fix them?
Use the property =:powerline-scale= of the variable =dotspacemacs-default-font=.
See font section of the [[file:DOCUMENTATION.org][documentation]] for more details.

** The powerline separators have no anti-aliasing, what can I do?
Emacs powerline uses XMP images to draw the separators in a graphical
environment. You can have anti-aliasing if you use the =utf8= separator. Note
that by default the =utf8= separator is used in a terminal. See the powerline
section in the font section of the [[file:DOCUMENTATION.org][documentation]].

** Why is after-init-hook not executed?
Don't launch Spacemacs with =emacs -q -l init.el= command. This command will run
the hooked function in =after-init-hook= before the evaluation of the passed =-l
init.el= file.

** What is the difference between =spacemacs-base= and =spacemacs= distributions?
The =distribution= concept was introduced in 0.104.x. You can now choose
between two distributions =spacemacs= or =spacemacs-base=.
=spacemacs-base= contains only a minimal set of packages; whereas =spacemacs=
is the full Spacemacs experience.
Set the distribution with =dotspacemacs-distribution= variable. The default is
=spacemacs=. For more information as to what is included,
check out the =packages.el= file in the respective folders in the
=+distribution= folder of the =layers/= directory.

** How can I change or define an alias for an =evil-leader= prefix?
It is possible to change an =evil-leader= prefix by binding its keymap to
another sequence. For instance, if you want to switch ~SPC l~
(=evil-avy-goto-line=) with ~SPC L~ (=perspectives= layer) to make the later
easier to reach, you can use:

#+begin_src emacs-lisp
(evil-leader/set-key
  "l" (lookup-key evil-leader--default-map "L")
  "L" 'evil-avy-goto-line)
#+end_src

** Should I place my settings in =user-init= or =user-config=?
Any variable that layer configuration code will *read* and *act on* must be set
in =user-init=, and any variable that Spacemacs explicitly sets but you wish to
*override* must be set in =user-config=.

Anything that isn't just setting a variable should 99% be in =user-config=.

** Why do some of my =org=-related settings cause problems?
Since version 0.104, spacemacs uses the `org` version from the org ELPA
repository instead of the one shipped with emacs. Then, any `org` related code
should not be loaded before `dotspacemacs/user-config`, otherwise both versions
will be loaded and will conflict.

* How do I...
