doc/doc/FAQ.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-10-30 Fri 21:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Frequently Asked Questions</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
              href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
         <link rel="stylesheet" type="text/css"
              href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Frequently Asked Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline12">1. Common</a>
<ul>
<li><a href="#orgheadline1">1.1. Which version of Spacemacs am I running?</a></li>
<li><a href="#orgheadline2">1.2. What is the official pronunciation of Spacemacs?</a></li>
<li><a href="#orgheadline3">1.3. Why are packages installed with <code>package-install</code> automatically deleted by Spacemacs when it boots?</a></li>
<li><a href="#orgheadline4">1.4. The Spacemacs banner is ugly, what should I do?</a></li>
<li><a href="#orgheadline5">1.5. The powerline separators are ugly, how can I fix them?</a></li>
<li><a href="#orgheadline6">1.6. The powerline separators have no anti-aliasing, what can I do?</a></li>
<li><a href="#orgheadline7">1.7. Why is after-init-hook not executed?</a></li>
<li><a href="#orgheadline8">1.8. What is the difference between <code>spacemacs-base</code> and <code>spacemacs</code> distributions?</a></li>
<li><a href="#orgheadline9">1.9. How can I change or define an alias for an <code>evil-leader</code> prefix?</a></li>
<li><a href="#orgheadline10">1.10. Should I place my settings in <code>user-init</code> or <code>user-config</code>?</a></li>
<li><a href="#orgheadline11">1.11. Why do some of my <code>org</code>-related settings cause problems?</a></li>
</ul>
</li>
<li><a href="#orgheadline21">2. How do I&#x2026;</a>
<ul>
<li><a href="#orgheadline13">2.1. Disable a package completely?</a></li>
<li><a href="#orgheadline14">2.2. Disable a package only for a specific major-mode?</a></li>
<li><a href="#orgheadline15">2.3. Disable company for a specific major-mode?</a></li>
<li><a href="#orgheadline16">2.4. Change special buffer rules?</a></li>
<li><a href="#orgheadline17">2.5. Enable navigation by visual lines?</a></li>
<li><a href="#orgheadline18">2.6. Disable evilification of a mode?</a></li>
<li><a href="#orgheadline19">2.7. Include underscores in word motions?</a></li>
<li><a href="#orgheadline20">2.8. Setup <code>$PATH</code>?</a></li>
</ul>
</li>
<li><a href="#orgheadline25">3. Windows</a>
<ul>
<li><a href="#orgheadline22">3.1. Why do the fonts look crappy on Windows?</a></li>
<li><a href="#orgheadline23">3.2. Why is there no Spacemacs logo in the startup buffer?</a></li>
<li><a href="#orgheadline24">3.3. Why are all packages unavailable?</a></li>
</ul>
</li>
<li><a href="#orgheadline27">4. OS X</a>
<ul>
<li><a href="#orgheadline26">4.1. Why are the powerline colors not correct on OS X?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">1</span> Common</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Which version of Spacemacs am I running?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The version is displayed on the upper right corner of the loading screen. You
may also just type <code>SPC f e v</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> What is the official pronunciation of Spacemacs?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
As it is written, that is <span class="underline">space</span> then <span class="underline">macs</span>.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Why are packages installed with <code>package-install</code> automatically deleted by Spacemacs when it boots?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
To declare new packages you have to create a new configuration layer, see the
<a href="QUICK_START.html">quick start guide</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> The Spacemacs banner is ugly, what should I do?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Install the default font supported by Spacemacs or choose a fixed width font.
More information in the font section of the <a href="DOCUMENTATION.html">documentation</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> The powerline separators are ugly, how can I fix them?</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Use the property <code>:powerline-scale</code> of the variable <code>dotspacemacs-default-font</code>.
See font section of the <a href="DOCUMENTATION.html">documentation</a> for more details.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> The powerline separators have no anti-aliasing, what can I do?</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Emacs powerline uses XMP images to draw the separators in a graphical
environment. You can have anti-aliasing if you use the <code>utf8</code> separator. Note
that by default the <code>utf8</code> separator is used in a terminal. See the powerline
section in the font section of the <a href="DOCUMENTATION.html">documentation</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> Why is after-init-hook not executed?</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Don't launch Spacemacs with <code>emacs -q -l init.el</code> command. This command will run
the hooked function in <code>after-init-hook</code> before the evaluation of the passed <code>-l
init.el</code> file.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> What is the difference between <code>spacemacs-base</code> and <code>spacemacs</code> distributions?</h3>
<div class="outline-text-3" id="text-1-8">
<p>
The <code>distribution</code> concept was introduced in 0.104.x. You can now choose
between two distributions <code>spacemacs</code> or <code>spacemacs-base</code>.
<code>spacemacs-base</code> contains only a minimal set of packages; whereas <code>spacemacs</code>
is the full Spacemacs experience.
Set the distribution with <code>dotspacemacs-distribution</code> variable. The default is
<code>spacemacs</code>. For more information as to what is included,
check out the <code>packages.el</code> file in the respective folders in the
<code>+distribution</code> folder of the <code>layers/</code> directory.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.9</span> How can I change or define an alias for an <code>evil-leader</code> prefix?</h3>
<div class="outline-text-3" id="text-1-9">
<p>
It is possible to change an <code>evil-leader</code> prefix by binding its keymap to
another sequence. For instance, if you want to switch <code>SPC l</code>
(<code>evil-avy-goto-line</code>) with <code>SPC L</code> (<code>perspectives</code> layer) to make the later
easier to reach, you can use:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>evil-leader/set-key
  <span style="color: #E6DB74; font-style: italic;">"l"</span> <span style="color: #66D9EF;">(</span>lookup-key evil-leader--default-map <span style="color: #E6DB74; font-style: italic;">"L"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #E6DB74; font-style: italic;">"L"</span> 'evil-avy-goto-line<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.10</span> Should I place my settings in <code>user-init</code> or <code>user-config</code>?</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Any variable that layer configuration code will <b>read</b> and <b>act on</b> must be set
in <code>user-init</code>, and any variable that Spacemacs explicitly sets but you wish to
<b>override</b> must be set in <code>user-config</code>.
</p>

<p>
Anything that isn't just setting a variable should 99% be in <code>user-config</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.11</span> Why do some of my <code>org</code>-related settings cause problems?</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Since version 0.104, spacemacs uses the `org` version from the org ELPA
repository instead of the one shipped with emacs. Then, any `org` related code
should not be loaded before `dotspacemacs/user-config`, otherwise both versions
will be loaded and will conflict.
</p>
</div>
</div>
</div>
