doc/doc/FAQ.html

<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">2</span> How do I&#x2026;</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">2.1</span> Disable a package completely?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To completely disable a package and effectively uninstalling it even if
it is part of your used layers, look for the variable
<code>dotspacemacs-excluded-packages</code> in your dotfile and add the package
name to it:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>setq-default dotspacemacs-excluded-packages '<span style="color: #66D9EF;">(</span>package1 package2 ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">2.2</span> Disable a package only for a specific major-mode?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This is done by removing the hook added by Spacemacs. For example to
remove <code>flycheck</code> support in python buffers, look for the function
<code>dotspacemacs/user-config</code> in your dotfile and add the following code:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>remove-hook 'python-mode-hook 'flycheck-mode<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
<b>Hint</b> to know the name of the major-mode of the current buffer press:
<code>SPC h d v major-mode RET</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.3</span> Disable company for a specific major-mode?</h3>
<div class="outline-text-3" id="text-2-3">
<p>
It may be handy to disable <code>company</code> for a given mode if you plan on
configuring <code>auto-complete</code> instead. On easy way to do it is to use the
macro <code>spacemacs|disable-company</code> in the function <code>dotspacemacs/user-config</code>
of your dotfile. The following snippet disables company for
<code>python-mode</code>:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>spacemacs|disable-company python-mode<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">2.4</span> Change special buffer rules?</h3>
<div class="outline-text-3" id="text-2-4">
<p>
To change the way spacemacs marks buffers as useless, you can customize
<code>spacemacs-useless-buffers-regexp</code> which marks buffers matching the
regexp as useless. The variable <code>spacemacs-useful-buffers-regexp</code> marks
buffers matching the regexp as useful buffers. Both can be customized
the same way.
</p>

<p>
Examples:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #75715E;">;; </span><span style="color: #75715E; font-style: italic;">Only mark helm buffers as useless</span>
<span style="color: #AE81FF;">(</span>setq spacemacs-useless-buffers-regexp '<span style="color: #66D9EF;">(</span><span style="color: #E6DB74; font-style: italic;">"\\*helm\.\+\\*"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #75715E;">;; </span><span style="color: #75715E; font-style: italic;">Marking the *Messages* buffer as useful</span>
<span style="color: #AE81FF;">(</span>push <span style="color: #E6DB74; font-style: italic;">"\\*Messages\\*"</span> spacemacs-useful-buffers-regexp<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">2.5</span> Enable navigation by visual lines?</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Add the following snippet to your <code>dostpacemacs/config</code> function:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #75715E;">;; </span><span style="color: #75715E; font-style: italic;">Make evil-mode up/down operate in screen lines instead of logical lines</span>
<span style="color: #AE81FF;">(</span>define-key evil-motion-state-map <span style="color: #E6DB74; font-style: italic;">"j"</span> 'evil-next-visual-line<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>define-key evil-motion-state-map <span style="color: #E6DB74; font-style: italic;">"k"</span> 'evil-previous-visual-line<span style="color: #AE81FF;">)</span>
<span style="color: #75715E;">;; </span><span style="color: #75715E; font-style: italic;">Also in visual mode</span>
<span style="color: #AE81FF;">(</span>define-key evil-visual-state-map <span style="color: #E6DB74; font-style: italic;">"j"</span> 'evil-next-visual-line<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>define-key evil-visual-state-map <span style="color: #E6DB74; font-style: italic;">"k"</span> 'evil-previous-visual-line<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">2.6</span> Disable evilification of a mode?</h3>
<div class="outline-text-3" id="text-2-6">
<p>
You can ensure a mode opens in emacs state by using <code>evil-set-initial-state</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>evil-set-initial-state 'magit-status-mode 'emacs<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
You can also do this using buffer name regular expressions. E.g. for magit,
which has a number of different major modes, you can catch them all with
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>push '<span style="color: #66D9EF;">(</span><span style="color: #E6DB74; font-style: italic;">"*magit"</span> . emacs<span style="color: #66D9EF;">)</span> evil-buffer-regexps<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
This should make all original magit bindings work in the major modes in
question. To enable the leader key in this case, you may have to define a
binding in the mode's map, e.g. for <code>magit-status-mode</code>,
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672; font-weight: bold;">with-eval-after-load</span> 'magit
  <span style="color: #66D9EF;">(</span>define-key magit-status-mode-map
    <span style="color: #A6E22E;">(</span>kbd dotspacemacs-leader-key<span style="color: #A6E22E;">)</span> evil-leader--default-map<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">2.7</span> Include underscores in word motions?</h3>
<div class="outline-text-3" id="text-2-7">
<p>
You can modify the syntax table of the mode in question. For example, for Python
mode:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672; font-weight: bold;">with-eval-after-load</span> 'python
  <span style="color: #66D9EF;">(</span>modify-syntax-entry ?_ <span style="color: #E6DB74; font-style: italic;">"w"</span> python-mode-syntax-table<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
