doc/doc/FAQ.html

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">2.8</span> Setup <code>$PATH</code>?</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Some layers require certain tools to be available on your <code>$PATH</code>. This means
that your <code>$PATH</code> must contain the installation paths for those tools. For
example, if you have installed some tools to <code>~/.local/bin</code> and want them to be
available in Spacemacs, you need to add <code>~/.local/bin</code> to your <code>$PATH</code>.
</p>

<p>
Users of <code>bash</code>, <code>zsh</code>, <code>sh</code> and other similar shells should add following line
to their <code>.bashrc</code> (<code>.zshrc</code>, <code>.profile</code> or your shell's equivalent). Note that
the <code>export</code> part is very important.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff9eb8;">export</span> <span style="color: #FD971F;">PATH</span>=~/.local/bin:$<span style="color: #FD971F;">PATH</span>
</pre>
</div>

<p>
Users of <code>fish</code> should add following line to their <code>config.fish</code> file (should be
in <code>$XDG_CONFIG_HOME</code> or its default value - <code>~/.config/fish</code>). Note that <code>-x</code>
part is very important.
</p>

<div class="org-src-container">

<pre class="src src-fish"><span style="color: #F92672; font-weight: bold;">set</span> <span style="color: #E6DB74; font-weight: bold;">-x</span> <span style="color: #FD971F;">PATH</span> ~/.local/bin <span style="color: #E6DB74; font-style: italic;">$</span><span style="color: #FD971F;">PATH</span>
</pre>
</div>

<p>
Users of other shells should consult its documentation on how to setup <code>$PATH</code>
variable (with export to environment).
</p>

<p>
So now, <code>~/.local/bin</code> should be available in your <code>$PATH</code>. You can verify this
by calling <code>echo $PATH</code>. But you also should verify that <code>$PATH</code> is set properly
in your environment. To do so call following command in your terminal.
</p>

<div class="org-src-container">

<pre class="src src-sh">$ env | grep <span style="color: #E6DB74; font-style: italic;">"PATH"</span>
</pre>
</div>

<p>
This is the value that will be used by Emacs. So it must contain <code>~/.local/bin</code>.
</p>

<p>
After that you can run Spacemacs and check that it properly gets the value of
<code>$PATH</code> by running <code>M-: (getenv "PATH")</code>.
</p>

<p>
Note that having <code>~/.local.bin</code> in your <code>$PATH</code> also means that it's possible to
run terminal and call tools from <code>~/.local/bin</code> without specifying their full
path. Under certain conditions you might want to avoid modifying your <code>$PATH</code>.
In that case you have the option of updating the value of <code>exec-path</code> in the
<code>dotspacemacs/user-config</code> function of your <code>.spacemacs</code> file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'exec-path <span style="color: #E6DB74; font-style: italic;">"~/.local/bin/"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">3</span> Windows</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">3.1</span> Why do the fonts look crappy on Windows?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You can install <a href="https://code.google.com/p/mactype/">MacType</a> on Windows to get very nice looking fonts. It is
also recommended to disable smooth scrolling on Windows.
</p>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">3.2</span> Why is there no Spacemacs logo in the startup buffer?</h3>
<div class="outline-text-3" id="text-3-2">
<p>
A GUI build of emacs supporting image display is required.
You can follow the instructions <a href="http://stackoverflow.com/questions/2650041/emacs-under-windows-and-png-files">here</a>. Alternatively you can download binaries
of emacs with image support included such as <a href="http://emacsbinw64.sourceforge.net/">this one</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">3.3</span> Why are all packages unavailable?</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Check if your Emacs has HTTPS capabilities by doing <code>M-:</code> and then:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>gnutls-available-p<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
If this returns <code>nil</code>, you need to install the GnuTLS DDL file in the same
directory as Emacs. See <a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs-gnutls.html#Help-For-Users">here</a> for instructions.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">4</span> OS X</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">4.1</span> Why are the powerline colors not correct on OS X?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is a <a href="https://github.com/milkypostman/powerline/issues/54">known issue</a> as of Emacs 24.4 due to <code>ns-use-srgb-colorspace</code>
defaulting to true. It is recommended to use the <a href="http://github.com/railwaycat/homebrew-emacsmacport">emacs-mac-port</a> build. See the
install section in the <a href="../README.md">README</a> for more details.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-10-30 Fri 21:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
